package constant

import (
	"errors"
)

var (
	AError = errors.New("....")
)

// 接口统一错误码
var (
	CODE_SUCCESS = 0 // 成功

	// 请求参数错误
	CODE_111001001 = 111001001 // 请求参数错误
	CODE_111001002 = 111001002 // 手机号码不能为空
	CODE_111001003 = 111001003 // 邮箱不能为空
	CODE_111001004 = 111001004 // 手机号和邮箱不能同时为空
	CODE_111001005 = 111001005 // 用户名不能为空
	CODE_111001006 = 111001006 // 验证码不能为空
	CODE_111001007 = 111001007 // 密码不能为空
	CODE_111001008 = 111001008 // app_id不能为空
	CODE_111001009 = 111001009 // app_ids列表不能为空
	CODE_111001010 = 111001010 // app_name不能为空
	CODE_111001011 = 111001011 // 用户uuid列表不能为空
	CODE_111001012 = 111001012 // 手机号码格式错误
	CODE_111001013 = 111001013 // 密码格式错误
	CODE_111001014 = 111001014 // 验证码格式错误
	CODE_111001015 = 111001015 // 邮箱格式错误
	CODE_111001016 = 111001016 // uuid格式错误
	CODE_111001017 = 111001017 // 加密算法参数错误
	CODE_111001018 = 111001018 // token格式错误

	// 数据存储类错误
	CODE_111002001 = 111002001 // 数据库创建新用户失败
	CODE_111002002 = 111002002 // 数据库获取用户信息失败
	CODE_111002003 = 111002003 // 数据库获取用户权限信息失败
	CODE_111002004 = 111002004 // 数据库更新用户信息失败
	CODE_111002005 = 111002005 // 数据库获取app信息失败
	CODE_111002006 = 111002006 // 数据库保存app信息失败
	CODE_111002007 = 111002007 // 数据库删除app信息失败
	CODE_111002008 = 111002008 // redis保存token失败
	CODE_111002009 = 111002009 // redis获取token失败
	CODE_111002010 = 111002010 // redis保存验证码失败
	CODE_111002011 = 111002011 // redis获取验证码失败

	// 业务逻辑错误
	CODE_111003001 = 111003001 // app_id不存在
	CODE_111003002 = 111003002 // 用户不存在
	CODE_111003003 = 111003003 // 该手机号或邮箱已被使用
	CODE_111003004 = 111003004 // 请求短信服务发送短信失败
	CODE_111003005 = 111003005 // app_name不能重复
	CODE_111003006 = 111003006 // 原密码错误
	CODE_111003007 = 111003007 // 新密码与原密码相同
	CODE_111003008 = 111003008 // 密码错误
	CODE_111003009 = 111003009 // 邮件发送失败
	CODE_111003010 = 111003010 // 验证码超时
	CODE_111003011 = 111003011 // 验证码错误
	CODE_111003012 = 111003012 // token已失效或过期
	CODE_111003013 = 111003013 // token不合法
	CODE_111003014 = 111003014 // 发送邮件失败
	CODE_111003015 = 111003015 // 用户没有绑定权限
)

var CODES = map[int]string{
	CODE_SUCCESS: "success",
	// 请求参数错误
	CODE_111001001: "请求参数错误",
	CODE_111001002: "手机号码不能为空",
	CODE_111001003: "邮箱不能为空",
	CODE_111001004: "手机号和邮箱不能同时为空",
	CODE_111001005: "用户名不能为空",
	CODE_111001006: "验证码不能为空",
	CODE_111001007: "密码不能为空",
	CODE_111001008: "app_id不能为空",
	CODE_111001009: "app_ids列表不能为空",
	CODE_111001010: "app_name不能为空",
	CODE_111001011: "用户uuid列表不能为空",
	CODE_111001012: "手机号码格式错误",
	CODE_111001013: "密码格式错误",
	CODE_111001014: "验证码格式错误",
	CODE_111001015: "邮箱格式错误",
	CODE_111001016: "uuid格式错误",
	CODE_111001017: "加密算法参数错误",
	CODE_111001018: "token格式错误",
	CODE_111002001: "数据库创建新用户失败",
	CODE_111002002: "数据库获取用户信息失败",
	CODE_111002003: "数据库获取用户权限信息失败",
	CODE_111002004: "数据库更新用户信息失败",
	CODE_111002005: "数据库获取app信息失败",
	CODE_111002006: "数据库保存app信息失败",
	CODE_111002007: "数据库删除app信息失败",
	CODE_111002008: "redis保存token失败",
	CODE_111002009: "redis获取token失败",
	CODE_111002010: "redis保存验证码失败",
	CODE_111002011: "redis获取验证码失败",
	CODE_111003001: "app_id不存在",
	CODE_111003002: "用户不存在",
	CODE_111003003: "该手机号或邮箱已被使用",
	CODE_111003004: "请求短信服务发送短信失败",
	CODE_111003005: "app_name不能重复",
	CODE_111003006: "原密码错误",
	CODE_111003007: "新密码与原密码相同",
	CODE_111003008: "密码错误",
	CODE_111003009: "邮件发送失败",
	CODE_111003010: "验证码超时",
	CODE_111003011: "验证码错误",
	CODE_111003012: "token已失效或过期",
	CODE_111003013: "token不合法",
	CODE_111003014: "发送邮件失败",
	CODE_111003015: "用户没有绑定权限",
}
